src/main/java/ok/dht/test/slastin/report/wrk2/get-10000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 17.210ms, rate sampling interval: 157ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.91ms    1.52ms  20.54ms   96.40%
    Req/Sec    10.04k   103.41    10.60k    92.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  682.00us
 75.000%    0.97ms
 90.000%    1.14ms
 99.000%    7.75ms
 99.900%   18.29ms
 99.990%   20.35ms
 99.999%   20.53ms
100.000%   20.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.071     0.000000            6         1.00
       0.208     0.100000        35012         1.11
       0.331     0.200000        70064         1.25
       0.451     0.300000       105199         1.43
       0.565     0.400000       140187         1.67
       0.682     0.500000       175213         2.00
       0.739     0.550000       192532         2.22
       0.797     0.600000       210229         2.50
       0.855     0.650000       227618         2.86
       0.912     0.700000       245210         3.33
       0.968     0.750000       262740         4.00
       0.996     0.775000       271488         4.44
       1.025     0.800000       280284         5.00
       1.053     0.825000       289010         5.71
       1.081     0.850000       297574         6.67
       1.109     0.875000       306346         8.00
       1.123     0.887500       310872         8.89
       1.139     0.900000       315171        10.00
       1.182     0.912500       319423        11.43
       1.264     0.925000       323809        13.33
       1.407     0.937500       328174        16.00
       1.532     0.943750       330371        17.78
       1.637     0.950000       332548        20.00
       1.793     0.956250       334737        22.86
       2.299     0.962500       336928        26.67
       3.063     0.968750       339109        32.00
       3.607     0.971875       340207        35.56
       4.259     0.975000       341298        40.00
       5.071     0.978125       342400        45.71
       5.491     0.981250       343486        53.33
       5.899     0.984375       344588        64.00
       6.027     0.985938       345136        71.11
       6.539     0.987500       345673        80.00
       7.123     0.989062       346223        91.43
       8.175     0.990625       346768       106.67
      10.255     0.992188       347314       128.00
      11.151     0.992969       347588       142.22
      11.975     0.993750       347862       160.00
      12.775     0.994531       348142       182.86
      13.511     0.995313       348408       213.33
      14.607     0.996094       348681       256.00
      15.167     0.996484       348818       284.44
      15.631     0.996875       348955       320.00
      15.975     0.997266       349091       365.71
      16.335     0.997656       349229       426.67
      16.751     0.998047       349366       512.00
      16.943     0.998242       349434       568.89
      17.071     0.998437       349505       640.00
      17.247     0.998633       349573       731.43
      17.551     0.998828       349638       853.33
      18.383     0.999023       349707      1024.00
      18.783     0.999121       349741      1137.78
      19.167     0.999219       349775      1280.00
      19.439     0.999316       349810      1462.86
      19.711     0.999414       349855      1706.67
      19.839     0.999512       349879      2048.00
      19.903     0.999561       349896      2275.56
      19.951     0.999609       349913      2560.00
      19.999     0.999658       349930      2925.71
      20.143     0.999707       349947      3413.33
      20.207     0.999756       349965      4096.00
      20.223     0.999780       349973      4551.11
      20.239     0.999805       349984      5120.00
      20.271     0.999829       349990      5851.43
      20.303     0.999854       350002      6826.67
      20.319     0.999878       350006      8192.00
      20.335     0.999890       350011      9102.22
      20.351     0.999902       350019     10240.00
      20.351     0.999915       350019     11702.86
      20.367     0.999927       350027     13653.33
      20.367     0.999939       350027     16384.00
      20.383     0.999945       350030     18204.44
      20.399     0.999951       350031     20480.00
      20.431     0.999957       350035     23405.71
      20.447     0.999963       350036     27306.67
      20.479     0.999969       350040     32768.00
      20.479     0.999973       350040     36408.89
      20.479     0.999976       350040     40960.00
      20.495     0.999979       350041     46811.43
      20.511     0.999982       350043     54613.33
      20.511     0.999985       350043     65536.00
      20.527     0.999986       350044     72817.78
      20.527     0.999988       350044     81920.00
      20.543     0.999989       350047     93622.86
      20.543     0.999991       350047    109226.67
      20.543     0.999992       350047    131072.00
      20.543     0.999993       350047    145635.56
      20.543     0.999994       350047    163840.00
      20.543     0.999995       350047    187245.71
      20.543     0.999995       350047    218453.33
      20.543     0.999996       350047    262144.00
      20.543     0.999997       350047    291271.11
      20.543     0.999997       350047    327680.00
      20.559     0.999997       350048    374491.43
      20.559     1.000000       350048          inf
#[Mean    =        0.906, StdDeviation   =        1.515]
#[Max     =       20.544, Total count    =       350048]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  449983 requests in 45.00s, 593.16MB read
Requests/sec:   9999.75
Transfer/sec:     13.18MB