src/main/java/ok/dht/test/slastin/report/wrk2/get-20000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 1477.128ms, rate sampling interval: 6266ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.83s     4.08s   17.87s    58.64%
    Req/Sec    11.92k   259.85    12.23k    20.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.97s 
 75.000%   14.37s 
 90.000%   16.33s 
 99.000%   17.76s 
 99.900%   17.87s 
 99.990%   17.89s 
 99.999%   17.89s 
100.000%   17.89s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3653.631     0.000000            2         1.00
    5025.791     0.100000        41570         1.11
    6647.807     0.200000        83135         1.25
    8024.063     0.300000       124672         1.43
    9543.679     0.400000       166256         1.67
   10969.087     0.500000       207724         2.00
   11689.983     0.550000       228688         2.22
   12320.767     0.600000       249425         2.50
   13008.895     0.650000       270138         2.86
   13680.639     0.700000       290822         3.33
   14368.767     0.750000       311540         4.00
   14688.255     0.775000       322001         4.44
   14999.551     0.800000       332428         5.00
   15302.655     0.825000       342661         5.71
   15605.759     0.850000       353050         6.67
   15966.207     0.875000       363553         8.00
   16138.239     0.887500       368619         8.89
   16326.655     0.900000       373789        10.00
   16531.455     0.912500       378995        11.43
   16777.215     0.925000       384183        13.33
   17006.591     0.937500       389363        16.00
   17137.663     0.943750       392056        17.78
   17252.351     0.950000       394904        20.00
   17334.271     0.956250       397519        22.86
   17416.191     0.962500       400223        26.67
   17481.727     0.968750       402377        32.00
   17530.879     0.971875       404038        35.56
   17563.647     0.975000       405134        40.00
   17612.799     0.978125       406451        45.71
   17661.951     0.981250       408038        53.33
   17694.719     0.984375       409143        64.00
   17711.103     0.985938       409659        71.11
   17727.487     0.987500       410220        80.00
   17743.871     0.989062       410788        91.43
   17776.639     0.990625       411936       106.67
   17793.023     0.992188       412479       128.00
   17793.023     0.992969       412479       142.22
   17809.407     0.993750       413058       160.00
   17809.407     0.994531       413058       182.86
   17825.791     0.995313       413529       213.33
   17842.175     0.996094       414020       256.00
   17842.175     0.996484       414020       284.44
   17842.175     0.996875       414020       320.00
   17858.559     0.997266       414554       365.71
   17858.559     0.997656       414554       426.67
   17858.559     0.998047       414554       512.00
   17874.943     0.998242       415093       568.89
   17874.943     0.998437       415093       640.00
   17874.943     0.998633       415093       731.43
   17874.943     0.998828       415093       853.33
   17874.943     0.999023       415093      1024.00
   17874.943     0.999121       415093      1137.78
   17874.943     0.999219       415093      1280.00
   17874.943     0.999316       415093      1462.86
   17874.943     0.999414       415093      1706.67
   17891.327     0.999512       415306      2048.00
   17891.327     1.000000       415306          inf
#[Mean    =    10833.383, StdDeviation   =     4083.169]
#[Max     =    17874.944, Total count    =       415306]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  542333 requests in 45.00s, 600.29MB read
Requests/sec:  12051.86
Transfer/sec:     13.34MB