src/main/java/ok/dht/test/slastin/report/wrk2/get-25000.txt
Running 45s test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2069.201ms, rate sampling interval: 8536ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.11s     5.45s   23.64s    57.82%
    Req/Sec    11.57k   198.50    11.82k    50.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.19s 
 75.000%   18.76s 
 90.000%   21.69s 
 99.000%   23.45s 
 99.900%   23.63s 
 99.990%   23.66s 
 99.999%   23.66s 
100.000%   23.66s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4837.375     0.000000            2         1.00
    6606.847     0.100000        40502         1.11
    8413.183     0.200000        81120         1.25
   10280.959     0.300000       121424         1.43
   12156.927     0.400000       162010         1.67
   14188.543     0.500000       202316         2.00
   15097.855     0.550000       222540         2.22
   16048.127     0.600000       242823         2.50
   17006.591     0.650000       263144         2.86
   17858.559     0.700000       283457         3.33
   18759.679     0.750000       303559         4.00
   19267.583     0.775000       313631         4.44
   19726.335     0.800000       323962         5.00
   20201.471     0.825000       333892         5.71
   20709.375     0.850000       344023         6.67
   21217.279     0.875000       354126         8.00
   21446.655     0.887500       359139         8.89
   21692.415     0.900000       364517        10.00
   21905.407     0.912500       369535        11.43
   22134.783     0.925000       374434        13.33
   22396.927     0.937500       379351        16.00
   22511.615     0.943750       382066        17.78
   22626.303     0.950000       384680        20.00
   22740.991     0.956250       386960        22.86
   22872.063     0.962500       389488        26.67
   23019.519     0.968750       392133        32.00
   23085.055     0.971875       393476        35.56
   23150.591     0.975000       394630        40.00
   23232.511     0.978125       396105        45.71
   23281.663     0.981250       397090        53.33
   23347.199     0.984375       398599        64.00
   23363.583     0.985938       398989        71.11
   23396.351     0.987500       399685        80.00
   23429.119     0.989062       400301        91.43
   23461.887     0.990625       400921       106.67
   23494.655     0.992188       401532       128.00
   23511.039     0.992969       401852       142.22
   23527.423     0.993750       402139       160.00
   23543.807     0.994531       402438       182.86
   23560.191     0.995313       402736       213.33
   23576.575     0.996094       403119       256.00
   23592.959     0.996484       403535       284.44
   23592.959     0.996875       403535       320.00
   23592.959     0.997266       403535       365.71
   23609.343     0.997656       403844       426.67
   23609.343     0.998047       403844       512.00
   23625.727     0.998242       404228       568.89
   23625.727     0.998437       404228       640.00
   23625.727     0.998633       404228       731.43
   23625.727     0.998828       404228       853.33
   23625.727     0.999023       404228      1024.00
   23642.111     0.999121       404531      1137.78
   23642.111     0.999219       404531      1280.00
   23642.111     0.999316       404531      1462.86
   23642.111     0.999414       404531      1706.67
   23642.111     0.999512       404531      2048.00
   23642.111     0.999561       404531      2275.56
   23642.111     0.999609       404531      2560.00
   23642.111     0.999658       404531      2925.71
   23642.111     0.999707       404531      3413.33
   23642.111     0.999756       404531      4096.00
   23642.111     0.999780       404531      4551.11
   23658.495     0.999805       404616      5120.00
   23658.495     1.000000       404616          inf
#[Mean    =    14113.198, StdDeviation   =     5446.511]
#[Max     =    23642.112, Total count    =       404616]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  533804 requests in 45.00s, 599.63MB read
Requests/sec:  11862.49
Transfer/sec:     13.33MB